import Api from '../../../../config/Api'
import { delay } from 'redux-saga'
import { call, put, takeEvery, takeLatest } from 'redux-saga/effects'

import funnyguy from '../../../../assets/images/thumbs/funnyguy.jpeg'
import cryinggirl from '../../../../assets/images/thumbs/cryinggirl.jpeg'
import chairman from '../../../../assets/images/thumbs/chairman.jpeg'
import greenboy from '../../../../assets/images/thumbs/greenboy.jpeg'
import templestay from '../../../../assets/images/thumbs/templestay.jpeg'
import webtoonslave from '../../../../assets/images/thumbs/webtoonslave.jpeg'
import animate from '../../../../assets/images/thumbs/example.gif'
import animate_thumb from '../../../../assets/images/thumbs/example_thumb.png'

import {mergeDataToDummy} from '../../scenes/Asap/sagas/actions'
import {TEMPLATE} from '../../scenes/Asap/config/types'
import * as actionType from './types'


export const getTypeFromName = (name) => {
    switch (name) {
        case 'Single Focus Bar':
            return TEMPLATE.BAR_EMPHASIS
        case 'Horizontal Single Focus Bar':
            return TEMPLATE.BAR_HORIZONTAL_EMPHASIS
        case 'Single Not Focus Bar':
            return TEMPLATE.BAR
        case 'Horizontal Single Not Focus Bar':
            return TEMPLATE.BAR_HORIZONTAL
        case 'Grouped Bar':
            return TEMPLATE.BAR_GROUPED
        case 'Small Data Line':
            return TEMPLATE.LINE
        case 'Large Data Line':
            return TEMPLATE.LINE_DENSE
    }
}

const defaultPlaceholder = (type) => {
    switch (type) {
        case TEMPLATE.BAR_EMPHASIS:
            return {
                data: mergeDataToDummy([
                    ['기업', '영업이익'],
                    ['삼성디스플레이', '1조3000억원'],
                    ['삼성증권', '4530억원'],
                    ['현대차투자증권', '4890억원'],
                    ['신한금융투자', '5170억원'],
                ]),
                emphasisTarget: [1, 1, 1, 1],
                meta:{
                    title: '삼성디스플레이 2018년 1분기 영업이익 추정',
                    subtitle: '',
                    unit:'억원',
                    reference:'와이즈에프엔',
                    madeBy: 'jiggle'
                },
                paper: {
                    title: `아이폰 부진에 삼성디스플 1Q 실적, 절반으로 내려앉나`,
                    contents: `아이폰 X(iPhone X)가 수요부진으로 올해 1분기 생산량을 줄일 것으로 전망되면서 관련 부품사인 삼성디스플레이의 영업이익은 지난해 같은 기간의 절반 수준에 그칠 것이란 전망이 나온다. 엎친 데 덮친 격으로 중국 스마트폰 판매 부진도 부정적 요인이라는 분석이다.`
                }
            }
        case TEMPLATE.BAR_HORIZONTAL_EMPHASIS:
            return {
                data: mergeDataToDummy([
                    ['회사명', '규모'],
                    ['테슬라모터스', '1312'],
                    ['도요타', '508'],
                    ['스즈키', '41'],
                    ['닛산', '25'],
                    ['미쓰비시', '17'],
                ]),
                emphasisTarget: [1, 1, 1, 1],
                meta:{
                    title: '캘리포니아주 자동차업체의 탄소배출권 판매 현황',
                    subtitle: '2013년 9월까지 1년간',
                    unit:'크레딧',
                    reference:'캘리포니아주 대기자원위원회',
                    madeBy: 'jiggle'
                },
                paper:{
                    title: `"현대차보다 테슬라" 해외주식 쇼핑 열기 '후끈'`,
                    contents: `미국 주식에 10억원을 투자한 고액자산가 A씨는 최근 프라이빗뱅커(PB)의 조언으로 SK하이닉스 (78,700원 상승1200 1.6%)를 팔고 대만 반도체회사 TSMC를 매수했다. A씨는 "TSMC의 수익구조가 SK하이닉스보다 매력적이란 생각에 매수했다"고 설명했다. 올 들어 국내 투자자들이 글로벌 주식시장에 뛰어들며 해외주식 비중을 공격적으로 늘리고 있다. 6년째 박스권에 머문 한국 증시보다 수익기회가 높은 선진·신흥 주식시장에서 4차산업 관련주에 투자하는 수요가 급증하고 있다.  `
                }
            }
        case TEMPLATE.BAR:
            return {
                data: mergeDataToDummy([
                    ['연도', '잔고추이'],
                    ['2011', '2조 9090'],
                    ['2012', '2조 9595'],
                    ['2013', '3조 8116'],
                    ['2014', '4조 9200'],
                    ['2015', '6조 8965'],
                    ['2017 1월', '7조 3510'],
                    ['2017 2월', '7조 7117'],
                ]),
                emphasisTarget: [-1, -1, -1, -1],
                meta:{
                    title: '국내 전체 해외주식 잔고 추이',
                    subtitle: '2011년~2015년은 12월 기준',
                    unit:'억원',
                    reference:'예탁결제원, 금융투자협회',
                    madeBy: 'jiggle'
                },
                paper:{
                    title: `"현대차보다 테슬라" 해외주식 쇼핑 열기 '후끈'`,
                    contents: `미국 주식에 10억원을 투자한 고액자산가 A씨는 최근 프라이빗뱅커(PB)의 조언으로 SK하이닉스 (78,700원 상승1200 1.6%)를 팔고 대만 반도체회사 TSMC를 매수했다. A씨는 "TSMC의 수익구조가 SK하이닉스보다 매력적이란 생각에 매수했다"고 설명했다. 올 들어 국내 투자자들이 글로벌 주식시장에 뛰어들며 해외주식 비중을 공격적으로 늘리고 있다. 6년째 박스권에 머문 한국 증시보다 수익기회가 높은 선진·신흥 주식시장에서 4차산업 관련주에 투자하는 수요가 급증하고 있다.  `
                }
            }
        case TEMPLATE.BAR_HORIZONTAL:
            return {
                data: mergeDataToDummy([
                    ['모델', '국내 출고가'],
                    ['갤럭시S6엣지', '97.9000'],
                    ['갤럭시S7', '83.6000'],
                    ['갤럭시S7엣지', '92.4000'],
                    ['갤럭시S8', '93.5000'],
                    ['갤럭시S8플러스', '99.'],

                ]),
                emphasisTarget: [-1, -1, -1, -1],
                meta:{
                    title: '갤럭시S시리즈 초기 출고가',
                    subtitle: '',
                    unit:'만원',
                    reference:'삼성전자',
                    madeBy: 'jiggle'
                },
                paper:{
                    title: `"카메라 재창조" 갤S9, 내달 16일 출시…가격은?`,
                    contents: `상반기 스마트폰 최대 기대작 '갤럭시S9'이 베일을 벗었다. AR(증강현실), AI(인공지능) 등을 활용해 강력해진 카메라 기능과 더욱 얇아진 베젤리스 디자인이 특징이다. 내달 16일 글로벌 순차 출시되며 가격은 공개되지 않았지만 전작인 갤럭시S8과 비슷한 수준으로 책정될 것이라는 예상이다. `
                }
            }
        case TEMPLATE.BAR_GROUPED:
            return {
                data: mergeDataToDummy([
                    ['', '자본총액', '매출액', '당기순이익'],
                    ['부영', '7조6340', '2조3880', '940'],
                    ['호반건설', '3조6910', '5조4540', '9430'],
                    ['중흥건설', '2조6730', '5조4380', '7100'],

                ]),
                emphasisTarget: [-1, -1, -1, -1],
                meta:{
                    title: '중견건설사 3사 재무현황',
                    subtitle: '2017년 5월 기준',
                    unit:'억원',
                    reference:'공정거래위원회 기업진단 공개 시스템',
                    madeBy: 'jiggle'
                },
                paper:{
                    title: `[MT리포트]부영·호반·중흥 '신3인방'이 사는 법`,
                    contents: `지난 3년간 이어진 주택시장 호황은 건설사들의 명암을 갈랐다. 대형건설사들이 해외사업 부실로 주춤할 때 부영, 호반, 중흥 등 중견건설사 신3인방은 공공택지 입찰과 용지 확보에 나서 공격적으로 베팅하며 몸집을 키웠다. 보수적 경영으로 쌓은 현금으로 자체 사업을 늘리고 지역언론사를 비롯해 각종 인수전에 나서며 전국구 기업으로 떠오른 것. `
                }
            }
        case TEMPLATE.LINE:
            return {
                data: mergeDataToDummy([
                    ['연도', '롯데', '신라',],
                    ['2015년', '51.5', '28.2'],
                    ['2016년', '48.6', '27.8'],
                    ['2017년', '41.9', '26.8'],
                ]),
                emphasisTarget: [-1, -1, -1, -1],
                meta:{
                    title: '2015~2017년 면세점 3사 시장점유율 추이',
                    subtitle: '판매 매출 기준',
                    unit:'%',
                    reference:'윤호중 의원실, 관세청',
                    madeBy: 'jiggle'
                },
                paper:{
                    title: `[단독]롯데면세점, 강남 지역 송객수수료 인상`,
                    contents: `롯데면세점이 최근 강남 지역에서 단체여행객과 중국 보따리상인 '따이궁'을 유치하는 각 여행사에게 지급하는 송객수수료를 상향 조정했다. 지난해 사드(THAAD·고고도미사일방어체계) 보복 여파로 강남 지역 매출이 크게 줄자 모객에 나선 것. `
                }
            }
        case TEMPLATE.LINE_DENSE:
            return {
                data: mergeDataToDummy(
                    [['날짜','종가'],['1.2','257,000'],['1.3','256,500'],['1.4','246,500'],['1.5','246,500'],['1.8','247,500'],['1.9','249,500'],['1.10','255,000'],['1.11','251,000'],['1.12','247,500'],['1.15','247,000'],['1.16','253,000'],['1.17','256,500'],['1.18','255,000'],['1.19','267,000'],['1.22','269,500'],['1.23','268,000'],['1.24','270,000'],['1.25','268,000'],['1.26','246,000'],['1.26','266,000'],['1.31','242,000'],['2.1','245,000'],['2.2','241,000'],['2.3','242,500'],['2.6','241,000'],['2.7','243,500'],['2.8','242,000'],['2.9','239,500'],['2.10','241,000'],['2.13','243,000'],['2.14','248,000'],['2.15','251,000'],['2.16','254,500'],['2.17','259,500'],['2.20','261,000'],['2.21','260,000'],['2.22','259,500'],['2.23','258,000'],['2.24','259,500'],['2.27','259,000'],['2.28','255,000'],['3.2','250,500'],['3.3','241,500'],['3.6','241,500'],['3.7','244,000'],['3.8','240,500'],['3.9','243,500'],['3.10','244,000'],['3.13','242,500'],['3.14','246,000'],['3.15','242,500'],['3.16','242,500'],['3.17','242,500'],['3.20','246,000'],['3.21','253,500'],['3.22','255,500'],['3.23','253,000'],['3.24','247,500'],['3.27','243,000'],['3.28','243,000'],['3.29','236,000'],['3.30','235,000'],['3.31','240,500'],['4.3','239,500'],['4.4','235,500'],['4.5','229,000'],['4.6','224,000'],['4.7','224,000'],['4.10','222,000'],['4.11','218,500'],['4.12','222,000'],['4.13','222,000'],['4.14','223,000'],['4.17','220,500'],['4.18','219,000'],['4.19','215,000'],['4.20','220,500'],['4.21','221,500'],['4.24','225,500'],['4.25','229,000'],['4.26','230,000'],['4.27','227,000'],['4.28','222,000'],['5.2','230,000'],['5.4','228,500'],['5.8','246,500'],['5.10','245,500'],['5.11','250,000'],['5.12','247,000'],['5.15','247,000'],['5.16','249,500'],['5.17','252,500'],['5.18','260,000'],['5.19','273,000'],['5.22','274,500'],['5.23','280,000'],['5.24','278,000'],['5.25','283,000'],['5.26','281,500'],['5.29','281,000'],['5.30','281,000'],['5.31','274,500'],['6.1','273,000'],['6.2','270,500'],['6.5','275,500'],['6.7','265,000'],['6.8','264,500'],['6.9','264,500'],['6.12','263,000'],['6.13','263,500'],['6.14','266,000'],['6.15','264,500'],['6.16','263,000'],['6.19','261,000'],['6.20','257,000'],['6.21','254,500'],['6.22','258,000'],['6.23','257,000'],['6.26','255,500'],['6.27','253,500'],['6.28','254,500'],['6.29','255,000'],['6.30','250,000'],['7.3','258,500'],['7.4','250,500'],['7.5','248,000'],['7.6','248,500'],['7.7','245,500'],['7.10','243,000'],['7.11','243,500'],['7.12','244,500'],['7.13','245,000'],['7.14','250,500'],['7.17','249,500'],['7.18','249,000'],['7.19','247,500'],['7.20','246,000'],['7.21','243,500'],['7.24','244,000'],['7.25','245,500'],['7.26','248,000'],['7.27','247,000'],['7.28','255,500'],['7.31','246,000'],['8.1','245,500'],['8.2','247,000'],['8.3','250,500'],['8.4','255,000'],['8.7','253,500'],['8.8','250,000'],['8.9','253,000'],['8.10','257,500'],['8.11','255,000'],['8.14','252,500'],['8.16','247,000'],['8.17','245,000'],['8.18','246,000'],['8.21','252,500'],['8.22','251,000'],['8.23','250,500'],['8.24','252,000'],['8.25','252,500'],['8.28','251,000'],['8.29','245,000'],['8.30','244,500'],['8.31','236,000'],['9.1','241,000'],['9.4','238,500'],['9.5','238,500'],['9.6','235,000'],['9.7','236,000'],['9.8','225,000'],['9.11','217,000'],['9.12','219,000'],['9.13','215,000'],['9.14','213,500'],['9.15','216,000'],['9.18','216,500'],['9.19','217,500'],['9.20','219,000'],['9.21','216,000'],['9.22','218,000'],['9.25','220,000'],['9.26','231,500'],['9.27','231,500'],['9.28','232,500'],['9.29','240,000'],['10.10','241,500'],['10.11','242,000'],['10.12','238,000'],['10.13','243,500'],['10.16','241,000'],['10.17','236,000'],['10.18','240,000'],['10.19','249,000'],['10.20','248,000'],['10.23','245,500'],['10.24','244,000'],['10.25','239,000'],['10.26','256,000'],['10.27','255,500'],['10.30','254,000'],['10.31','266,500'],['11.1','265,000'],['11.2','266,000'],['11.3','271,000'],['11.6','272,500'],['11.7','266,000'],['11.8','265,000'],['11.9','268,500'],['11.10','268,500'],['11.13','273,000'],['11.14','268,000'],['11.15','266,500'],['11.16','263,500'],['11.17','255,500'],['11.20','255,500'],['11.21','254,000'],['11.22','253,000'],['11.23','255,000'],['11.24','255,500'],['11.27','254,000'],['11.28','260,000'],['11.29','263,500'],['11.30','273,500'],['12.1','269,000'],['12.4','268,500'],['12.5','268,500'],['12.6','263,500'],['12.7','263,000'],['12.8','262,000'],['12.11','257,000'],['12.12','256,000'],['12.13','259,500'],['12.14','257,000'],['12.15','267,000'],['12.18','267,000'],['12.19','268,000'],['12.20','264,500'],['12.21','259,000'],['12.22','260,000'],['12.26','261,000'],['12.27','268,000'],['12.28','263,000']]
                ),
                emphasisTarget: [-1, -1, -1, -1],
                meta:{
                    title: '주가흐름',
                    subtitle: '',
                    unit:'원',
                    reference:'',
                    madeBy: 'jiggle'
                },
                paper:{
                    title: `[단독]롯데면세점, 강남 지역 송객수수료 인상`,
                    contents: `롯데면세점이 최근 강남 지역에서 단체여행객과 중국 보따리상인 '따이궁'을 유치하는 각 여행사에게 지급하는 송객수수료를 상향 조정했다. 지난해 사드(THAAD·고고도미사일방어체계) 보복 여파로 강남 지역 매출이 크게 줄자 모객에 나선 것. `
                }
            }
    }

}

const description = [
    '1. 인구나 사용자 증가 지표등에 활용.',
    '2. 기업, 기관 등의 실적 비교에 활용.',
    '3. 국가 별 주요 경제지표 순위 등에 활용 할 수 있어요.',
    '4. 기업 기관의 가장 최근 수치를 강조할 때 활용합니다.',
    '5. 기업 실적 추이 등을 표현할 때 활용합니다.',
    '6. 기업, 기관의 예산, 모바일 API의 추이를 표현할 때 활용합니다.',
    '7. 주가 등 등락의 진폭이 큰 경제지표 표현에 활용합니다.'
]

export function* fetchTemplatesThumbnailsAsync() {
    try{
        const res = yield call(Api.fetchApi, ['/template/all'])
        let thumbnails = res.data
        thumbnails = thumbnails.map((template, i) => {
            const type = getTypeFromName(template.name)
            return Object.assign({}, template, {
                type,
                placeholder: defaultPlaceholder(type),
                description: description[i]
            })
        })

        yield put({
            type: actionType.TEMPLATES_THUMBNAILS_FETCH_SUCCESS,
            payload: thumbnails
        })
    }catch(error){
        yield put({
            type: actionType.TEMPLATES_THUMBNAILS_FETCH_FAILURE,
            payload: error
        })
    }

}

export function* watchFetchTemplatesThumbnailsAsync() {
    yield takeEvery(actionType.TEMPLATES_THUMBNAILS_FETCH_REQUEST, fetchTemplatesThumbnailsAsync)
}
